const DATA = {
  categories: [

    {
      name:"ثقافة",
      type:"question",
      questions:{
        easy:[
          {q:"عاصمة فرنسا؟",a:"باريس"},
          {q:"أكبر قارة؟",a:"آسيا"}
        ],
        medium:[
          {q:"عدد الدول العربية؟",a:"22"}
        ],
        hard:[
          {q:"من اكتشف الجاذبية؟",a:"نيوتن"}
        ]
      }
    },

    {
      name:"رياضة",
      type:"question",
      questions:{
        easy:[
          {q:"كم لاعب في كرة القدم؟",a:"11"}
        ],
        medium:[
          {q:"من فاز بكأس العالم 2022؟",a:"الأرجنتين"}
        ],
        hard:[
          {q:"كم عدد بطولات ريال مدريد؟",a:"14"}
        ]
      }
    },

    {
      name:"تمثيل",
      type:"acting",
      items:["طبيب","شرطي","مدرس"]
    },

    {
      name:"رسم",
      type:"drawing",
      items:["سيارة","قارب","شجرة"]
    },

    {
      name:"حظ",
      type:"luck",
      items:[
        "+200 نقطة",
        "-100 نقطة",
        "سرقة دور",
        "أول من يضحك يفوز"
      ]
    }

  ]
};